# Pandas Tab demo

This notebook demonstrates how Pandas Tab works.

<div class="alert alert-block alert-info">
    This runtime has the IPython hook installed with <code>pandas_tab init</code>. To run without the IPython hook, uncomment out the <code>import pandas_tab</code> below.
</div>

In [1]:
import pandas as pd
# import pandas_tab

df = pd.DataFrame({
    "foo":  ["a", "a", "b", "a", "b", "c", "a"],
    "bar":  [4,   5,   7,   6,   7,   7,   5],
    "fizz": [12,  63,  23,  36,  21,  28,  42]
})

In [2]:
# One-way tabulation
# One-way tabulation
df.tab("foo")

     size  percent
foo
a       4    57.14
b       2    28.57
c       1    14.29

In [3]:
# Two-way tabulation
df.tab("foo", "bar")

bar  4  5  6  7
foo
a    1  2  1  0
b    0  0  0  2
c    0  0  0  1

In [4]:
# One-way with aggregation
df.tab("foo", values="fizz", aggfunc=pd.Series.mean)

      mean
foo
a    38.25
b    22.00
c    28.00

In [5]:
# Two-way with aggregation
df.tab("foo", "bar", values="fizz", aggfunc=pd.Series.mean)

bar     4     5     6     7
foo
a    12.0  52.5  36.0   NaN
b     NaN   NaN   NaN  22.0
c     NaN   NaN   NaN  28.0